ExprovipFuel/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ExprovipFuel/src/Catalogs/Контрагенты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить реквизиты клиента.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты
//  ДатаСреза - Дата
// 
// Возвращаемое значение:
//  Структура - Получить реквизиты клиента:
// * НазваниеКлиента - Строка 
// * ПолноеНаименование - Строка
// * ЮридическийАдрес - Строка 
// * ПочтовыйКод - Строка
// * Тариф - СправочникСсылка.Скидки 
// * НИП - Строка
// * Логин - Строка
// * Телефон - Строка
// * Email - Строка
Функция ПолучитьРеквизитыКлиента(КонтрагентСсылка, ДатаСреза) Экспорт
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтрагентСсылка, "Наименование, НаименованиеПолное, ПочтовыйКод, НИП, Логин");
	
	ЮридическийАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента); //Строка
	ПочтовыйАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента); //Строка
	Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента); //Строка
	Email = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты); //Строка
	
	
	Структура = Новый Структура;
	Структура.Вставить("НазваниеКлиента", СтруктураРеквизитов.Наименование);
	Структура.Вставить("ПолноеНаименование", СтруктураРеквизитов.НаименованиеПолное);
	Структура.Вставить("ЮридическийАдрес", ЮридическийАдрес);
	Структура.Вставить("ПочтовыйАдрес", ПочтовыйАдрес);
	Структура.Вставить("ПочтовыйКод", СтруктураРеквизитов.ПочтовыйКод);
	Структура.Вставить("Телефон", Телефон);
	Структура.Вставить("Email", Email);
	//@skip-check reading-attribute-from-database
	Структура.Вставить("Тариф", Exprovip.ПолучитьВидСкидкиКонтрагента(КонтрагентСсылка, ДатаСреза));
	Структура.Вставить("НИП", СтруктураРеквизитов.НИП);
	Структура.Вставить("Логин", СтруктураРеквизитов.Логин);
	
	//@skip-check constructor-function-return-section
	Возврат Структура;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
